tap "eth-p/software"
tap "homebrew/autoupdate"
tap "homebrew/core"

brew "bash"
brew "bat"
brew "bat-extras-batman"
brew "curl"
brew "docker"
brew "eza"
brew "fd"
brew "fish"
brew "fisher"
brew "fzf"
brew "git"
brew "git-delta"
brew "htop"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "less"
brew "mas"
brew "micro"
brew "mkcert"
brew "ripgrep"
brew "sqlfluff"
brew "stow"
brew "tectonic"
brew "texlab"
brew "typst"
brew "uv"

cask "arc"
cask "blip"
cask "dockdoor"
cask "flux-app"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "hiddenbar"
cask "keka"
cask "maccy"
cask "mole"
cask "mos"
cask "obsidian"
cask "rectangle"
cask "skim"
cask "topnotch"
cask "zed"

mas "Color Picker", id: 1545870783
mas "The Unarchiver", id: 425424353
