tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/autoupdate"

brew "bat"
brew "docker"
brew "eth-p/software/bat-extras-batman"
brew "eza"
brew "fd"
# brew "fish"
# brew "fisher"
brew "fzf"
brew "git"
brew "git-delta"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "less"
brew "mas"
brew "micro"
brew "mkcert"
brew "pgformatter"
brew "powerlevel10k"
brew "ripgrep"
brew "stow"
brew "wget"

# TeX
cask "texstudio"
brew "tectonic"
brew "texlab"

cask "docker"
cask "drawio"
cask "flux"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "hiddenbar"
cask "maccy"
cask "obsidian"
cask "postman"
cask "rectangle"
cask "skim"
cask "telegram"
cask "topnotch"
cask "unnaturalscrollwheels"
cask "zed"

mas "Color Picker", id: 1545870783
mas "Keka", id: 470158793
mas "The Unarchiver", id: 425424353
